tsung/new_tests/admin_monitoring.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='100'/>
  </clients>

  <servers>
    <server host="localhost" port="3000" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="5" unit="second">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="5" unit="second">
      <users arrivalrate="2" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="3" duration="5" unit="second">
      <users arrivalrate="4" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="4" duration="5" unit="second">
      <users arrivalrate="8" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="5" duration="5" unit="second">
      <users arrivalrate="16" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="6" duration="5" unit="second">
      <users arrivalrate="32" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="7" duration="5" unit="second">
      <users arrivalrate="64" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="8" duration="5" unit="second">
      <users arrivalrate="128" unit="second"/>
    </arrivalphase>
  </load>


  <options>
    <option name="file_server" id="default" value="../data/users.csv"/>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"/>
  </options>

  <sessions>
    <session name="auditor" probability="100" type="ts_http">
      <transaction name="view_transaction_history">
        <request>
          <http url="/transactions"
                method="GET"/>
        </request>
      </transaction>

      <thinktime value="3" random="true"/>

      <transaction name="view_exchanges_history">
        <request subst="true">
          <http url="/exchanges"
                method="GET"/>
        </request>
      </transaction>

    </session>
  </sessions>
</tsung>